BitBoxSwiss/bitbox02-firmware/external/samd51a-ds/include/component/tal.h
/* -------- TAL_IRQTRIG : (TAL Offset: 0x164) (R/W 32) Interrupt Trigger -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
    struct {
        uint32_t ENABLE: 1;        /*!< bit:      0  Trigger Enable                     */
        uint32_t : 7;              /*!< bit:  1.. 7  Reserved                           */
        uint32_t IRQNUM: 8;        /*!< bit:  8..15  Interrupt Request Number           */
        uint32_t OVERRIDE: 8;      /*!< bit: 16..23  Interrupt Request Override Value   */
        uint32_t : 8;              /*!< bit: 24..31  Reserved                           */
    } bit;                       /*!< Structure used for bit  access                  */
    uint32_t reg;                /*!< Type      used for register access              */
} TAL_IRQTRIG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TAL_IRQTRIG_OFFSET          0x164        /**< \brief (TAL_IRQTRIG offset) Interrupt Trigger */
#define TAL_IRQTRIG_RESETVALUE      _U_(0x00000000) /**< \brief (TAL_IRQTRIG reset_value) Interrupt Trigger */

#define TAL_IRQTRIG_ENABLE_Pos      0            /**< \brief (TAL_IRQTRIG) Trigger Enable */
#define TAL_IRQTRIG_ENABLE          (_U_(0x1) << TAL_IRQTRIG_ENABLE_Pos)
#define TAL_IRQTRIG_IRQNUM_Pos      8            /**< \brief (TAL_IRQTRIG) Interrupt Request Number */
#define TAL_IRQTRIG_IRQNUM_Msk      (_U_(0xFF) << TAL_IRQTRIG_IRQNUM_Pos)
#define TAL_IRQTRIG_IRQNUM(value)   (TAL_IRQTRIG_IRQNUM_Msk & ((value) << TAL_IRQTRIG_IRQNUM_Pos))
#define TAL_IRQTRIG_OVERRIDE_Pos    16           /**< \brief (TAL_IRQTRIG) Interrupt Request Override Value */
#define TAL_IRQTRIG_OVERRIDE_Msk    (_U_(0xFF) << TAL_IRQTRIG_OVERRIDE_Pos)
#define TAL_IRQTRIG_OVERRIDE(value) (TAL_IRQTRIG_OVERRIDE_Msk & ((value) << TAL_IRQTRIG_OVERRIDE_Pos))
#define TAL_IRQTRIG_MASK            _U_(0x00FFFF01) /**< \brief (TAL_IRQTRIG) MASK Register */

/* -------- TAL_IRQMON : (TAL Offset: 0x168) (R/W 16) Interrupt Monitor Select -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
    struct {
        uint16_t EXTEND: 1;        /*!< bit:      0  Extended Interrupt Request         */
        uint16_t DROP: 1;          /*!< bit:      1  Drop Shortened Events              */
        uint16_t CPUID: 1;         /*!< bit:      2  ID of CPU currently servicing this IRQ */
        uint16_t : 5;              /*!< bit:  3.. 7  Reserved                           */
        uint16_t IRQNUM: 8;        /*!< bit:  8..15  Interrupt Request Number           */
    } bit;                       /*!< Structure used for bit  access                  */
    uint16_t reg;                /*!< Type      used for register access              */
} TAL_IRQMON_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TAL_IRQMON_OFFSET           0x168        /**< \brief (TAL_IRQMON offset) Interrupt Monitor Select */
#define TAL_IRQMON_RESETVALUE       _U_(0x0000)  /**< \brief (TAL_IRQMON reset_value) Interrupt Monitor Select */

#define TAL_IRQMON_EXTEND_Pos       0            /**< \brief (TAL_IRQMON) Extended Interrupt Request */
#define TAL_IRQMON_EXTEND           (_U_(0x1) << TAL_IRQMON_EXTEND_Pos)
#define   TAL_IRQMON_EXTEND_NO_Val        _U_(0x0)   /**< \brief (TAL_IRQMON) Event is Interrupt Request signal */
#define   TAL_IRQMON_EXTEND_YES_Val       _U_(0x1)   /**< \brief (TAL_IRQMON) Event is Interrupt Request signal extended until end of Interrupt Handler */
#define TAL_IRQMON_EXTEND_NO        (TAL_IRQMON_EXTEND_NO_Val      << TAL_IRQMON_EXTEND_Pos)
#define TAL_IRQMON_EXTEND_YES       (TAL_IRQMON_EXTEND_YES_Val     << TAL_IRQMON_EXTEND_Pos)
#define TAL_IRQMON_DROP_Pos         1            /**< \brief (TAL_IRQMON) Drop Shortened Events */
#define TAL_IRQMON_DROP             (_U_(0x1) << TAL_IRQMON_DROP_Pos)
#define TAL_IRQMON_CPUID_Pos        2            /**< \brief (TAL_IRQMON) ID of CPU currently servicing this IRQ */
#define TAL_IRQMON_CPUID_Msk        (_U_(0x1) << TAL_IRQMON_CPUID_Pos)
#define TAL_IRQMON_CPUID(value)     (TAL_IRQMON_CPUID_Msk & ((value) << TAL_IRQMON_CPUID_Pos))
#define TAL_IRQMON_IRQNUM_Pos       8            /**< \brief (TAL_IRQMON) Interrupt Request Number */
#define TAL_IRQMON_IRQNUM_Msk       (_U_(0xFF) << TAL_IRQMON_IRQNUM_Pos)
#define TAL_IRQMON_IRQNUM(value)    (TAL_IRQMON_IRQNUM_Msk & ((value) << TAL_IRQMON_IRQNUM_Pos))
#define TAL_IRQMON_MASK             _U_(0xFF07)  /**< \brief (TAL_IRQMON) MASK Register */

/* -------- TAL_CPUIRQS : (TAL Offset: 0x180) (R/  32) CPUIRQS Interrupt Status m for CPU n -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
    struct {
        uint32_t CPUIRQS: 32;      /*!< bit:  0..31  Interrupt Requests for CPU n       */
    } bit;                       /*!< Structure used for bit  access                  */
    uint32_t reg;                /*!< Type      used for register access              */
} TAL_CPUIRQS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TAL_CPUIRQS_OFFSET          0x180        /**< \brief (TAL_CPUIRQS offset) Interrupt Status m for CPU n */
#define TAL_CPUIRQS_RESETVALUE      _U_(0x00000000) /**< \brief (TAL_CPUIRQS reset_value) Interrupt Status m for CPU n */

#define TAL_CPUIRQS_CPUIRQS_Pos     0            /**< \brief (TAL_CPUIRQS) Interrupt Requests for CPU n */
#define TAL_CPUIRQS_CPUIRQS_Msk     (_U_(0xFFFFFFFF) << TAL_CPUIRQS_CPUIRQS_Pos)
#define TAL_CPUIRQS_CPUIRQS(value)  (TAL_CPUIRQS_CPUIRQS_Msk & ((value) << TAL_CPUIRQS_CPUIRQS_Pos))
#define TAL_CPUIRQS_MASK            _U_(0xFFFFFFFF) /**< \brief (TAL_CPUIRQS) MASK Register */

/* -------- TAL_SMASK : (TAL Offset: 0x200) (R/W 32) SMASKS Inter-Process Signal Mask m for CPU n -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
    struct {
        uint32_t IPS0: 1;          /*!< bit:      0  Inter-Process Signal 0             */
        uint32_t IPS1: 1;          /*!< bit:      1  Inter-Process Signal 1             */
        uint32_t IPS2: 1;          /*!< bit:      2  Inter-Process Signal 2             */
        uint32_t IPS3: 1;          /*!< bit:      3  Inter-Process Signal 3             */
        uint32_t IPS4: 1;          /*!< bit:      4  Inter-Process Signal 4             */
        uint32_t IPS5: 1;          /*!< bit:      5  Inter-Process Signal 5             */
        uint32_t IPS6: 1;          /*!< bit:      6  Inter-Process Signal 6             */
        uint32_t IPS7: 1;          /*!< bit:      7  Inter-Process Signal 7             */
        uint32_t IPS8: 1;          /*!< bit:      8  Inter-Process Signal 8             */
        uint32_t IPS9: 1;          /*!< bit:      9  Inter-Process Signal 9             */
        uint32_t IPS10: 1;         /*!< bit:     10  Inter-Process Signal 10            */
        uint32_t IPS11: 1;         /*!< bit:     11  Inter-Process Signal 11            */
        uint32_t IPS12: 1;         /*!< bit:     12  Inter-Process Signal 12            */
        uint32_t IPS13: 1;         /*!< bit:     13  Inter-Process Signal 13            */
        uint32_t IPS14: 1;         /*!< bit:     14  Inter-Process Signal 14            */
        uint32_t IPS15: 1;         /*!< bit:     15  Inter-Process Signal 15            */
        uint32_t IPS16: 1;         /*!< bit:     16  Inter-Process Signal 16            */
        uint32_t IPS17: 1;         /*!< bit:     17  Inter-Process Signal 17            */
        uint32_t IPS18: 1;         /*!< bit:     18  Inter-Process Signal 18            */
        uint32_t IPS19: 1;         /*!< bit:     19  Inter-Process Signal 19            */
        uint32_t IPS20: 1;         /*!< bit:     20  Inter-Process Signal 20            */
        uint32_t IPS21: 1;         /*!< bit:     21  Inter-Process Signal 21            */
        uint32_t IPS22: 1;         /*!< bit:     22  Inter-Process Signal 22            */
        uint32_t IPS23: 1;         /*!< bit:     23  Inter-Process Signal 23            */
        uint32_t IPS24: 1;         /*!< bit:     24  Inter-Process Signal 24            */
        uint32_t IPS25: 1;         /*!< bit:     25  Inter-Process Signal 25            */
        uint32_t IPS26: 1;         /*!< bit:     26  Inter-Process Signal 26            */
        uint32_t IPS27: 1;         /*!< bit:     27  Inter-Process Signal 27            */
        uint32_t IPS28: 1;         /*!< bit:     28  Inter-Process Signal 28            */
        uint32_t IPS29: 1;         /*!< bit:     29  Inter-Process Signal 29            */
        uint32_t IPS30: 1;         /*!< bit:     30  Inter-Process Signal 30            */
        uint32_t IPS31: 1;         /*!< bit:     31  Inter-Process Signal 31            */
    } bit;                       /*!< Structure used for bit  access                  */
    struct {
        uint32_t IPS: 32;          /*!< bit:  0..31  Inter-Process Signal x             */
    } vec;                       /*!< Structure used for vec  access                  */
    uint32_t reg;                /*!< Type      used for register access              */
} TAL_SMASK_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

