BitBoxSwiss/bitbox02-firmware/external/samd51a-ds/include/component/tal.h
#define TAL_SMASK_OFFSET            0x200        /**< \brief (TAL_SMASK offset) Inter-Process Signal Mask m for CPU n */
#define TAL_SMASK_RESETVALUE        _U_(0x00000000) /**< \brief (TAL_SMASK reset_value) Inter-Process Signal Mask m for CPU n */

#define TAL_SMASK_IPS0_Pos          0            /**< \brief (TAL_SMASK) Inter-Process Signal 0 */
#define TAL_SMASK_IPS0              (_U_(1) << TAL_SMASK_IPS0_Pos)
#define TAL_SMASK_IPS1_Pos          1            /**< \brief (TAL_SMASK) Inter-Process Signal 1 */
#define TAL_SMASK_IPS1              (_U_(1) << TAL_SMASK_IPS1_Pos)
#define TAL_SMASK_IPS2_Pos          2            /**< \brief (TAL_SMASK) Inter-Process Signal 2 */
#define TAL_SMASK_IPS2              (_U_(1) << TAL_SMASK_IPS2_Pos)
#define TAL_SMASK_IPS3_Pos          3            /**< \brief (TAL_SMASK) Inter-Process Signal 3 */
#define TAL_SMASK_IPS3              (_U_(1) << TAL_SMASK_IPS3_Pos)
#define TAL_SMASK_IPS4_Pos          4            /**< \brief (TAL_SMASK) Inter-Process Signal 4 */
#define TAL_SMASK_IPS4              (_U_(1) << TAL_SMASK_IPS4_Pos)
#define TAL_SMASK_IPS5_Pos          5            /**< \brief (TAL_SMASK) Inter-Process Signal 5 */
#define TAL_SMASK_IPS5              (_U_(1) << TAL_SMASK_IPS5_Pos)
#define TAL_SMASK_IPS6_Pos          6            /**< \brief (TAL_SMASK) Inter-Process Signal 6 */
#define TAL_SMASK_IPS6              (_U_(1) << TAL_SMASK_IPS6_Pos)
#define TAL_SMASK_IPS7_Pos          7            /**< \brief (TAL_SMASK) Inter-Process Signal 7 */
#define TAL_SMASK_IPS7              (_U_(1) << TAL_SMASK_IPS7_Pos)
#define TAL_SMASK_IPS8_Pos          8            /**< \brief (TAL_SMASK) Inter-Process Signal 8 */
#define TAL_SMASK_IPS8              (_U_(1) << TAL_SMASK_IPS8_Pos)
#define TAL_SMASK_IPS9_Pos          9            /**< \brief (TAL_SMASK) Inter-Process Signal 9 */
#define TAL_SMASK_IPS9              (_U_(1) << TAL_SMASK_IPS9_Pos)
#define TAL_SMASK_IPS10_Pos         10           /**< \brief (TAL_SMASK) Inter-Process Signal 10 */
#define TAL_SMASK_IPS10             (_U_(1) << TAL_SMASK_IPS10_Pos)
#define TAL_SMASK_IPS11_Pos         11           /**< \brief (TAL_SMASK) Inter-Process Signal 11 */
#define TAL_SMASK_IPS11             (_U_(1) << TAL_SMASK_IPS11_Pos)
#define TAL_SMASK_IPS12_Pos         12           /**< \brief (TAL_SMASK) Inter-Process Signal 12 */
#define TAL_SMASK_IPS12             (_U_(1) << TAL_SMASK_IPS12_Pos)
#define TAL_SMASK_IPS13_Pos         13           /**< \brief (TAL_SMASK) Inter-Process Signal 13 */
#define TAL_SMASK_IPS13             (_U_(1) << TAL_SMASK_IPS13_Pos)
#define TAL_SMASK_IPS14_Pos         14           /**< \brief (TAL_SMASK) Inter-Process Signal 14 */
#define TAL_SMASK_IPS14             (_U_(1) << TAL_SMASK_IPS14_Pos)
#define TAL_SMASK_IPS15_Pos         15           /**< \brief (TAL_SMASK) Inter-Process Signal 15 */
#define TAL_SMASK_IPS15             (_U_(1) << TAL_SMASK_IPS15_Pos)
#define TAL_SMASK_IPS16_Pos         16           /**< \brief (TAL_SMASK) Inter-Process Signal 16 */
#define TAL_SMASK_IPS16             (_U_(1) << TAL_SMASK_IPS16_Pos)
#define TAL_SMASK_IPS17_Pos         17           /**< \brief (TAL_SMASK) Inter-Process Signal 17 */
#define TAL_SMASK_IPS17             (_U_(1) << TAL_SMASK_IPS17_Pos)
#define TAL_SMASK_IPS18_Pos         18           /**< \brief (TAL_SMASK) Inter-Process Signal 18 */
#define TAL_SMASK_IPS18             (_U_(1) << TAL_SMASK_IPS18_Pos)
#define TAL_SMASK_IPS19_Pos         19           /**< \brief (TAL_SMASK) Inter-Process Signal 19 */
#define TAL_SMASK_IPS19             (_U_(1) << TAL_SMASK_IPS19_Pos)
#define TAL_SMASK_IPS20_Pos         20           /**< \brief (TAL_SMASK) Inter-Process Signal 20 */
#define TAL_SMASK_IPS20             (_U_(1) << TAL_SMASK_IPS20_Pos)
#define TAL_SMASK_IPS21_Pos         21           /**< \brief (TAL_SMASK) Inter-Process Signal 21 */
#define TAL_SMASK_IPS21             (_U_(1) << TAL_SMASK_IPS21_Pos)
#define TAL_SMASK_IPS22_Pos         22           /**< \brief (TAL_SMASK) Inter-Process Signal 22 */
#define TAL_SMASK_IPS22             (_U_(1) << TAL_SMASK_IPS22_Pos)
#define TAL_SMASK_IPS23_Pos         23           /**< \brief (TAL_SMASK) Inter-Process Signal 23 */
#define TAL_SMASK_IPS23             (_U_(1) << TAL_SMASK_IPS23_Pos)
#define TAL_SMASK_IPS24_Pos         24           /**< \brief (TAL_SMASK) Inter-Process Signal 24 */
#define TAL_SMASK_IPS24             (_U_(1) << TAL_SMASK_IPS24_Pos)
#define TAL_SMASK_IPS25_Pos         25           /**< \brief (TAL_SMASK) Inter-Process Signal 25 */
#define TAL_SMASK_IPS25             (_U_(1) << TAL_SMASK_IPS25_Pos)
#define TAL_SMASK_IPS26_Pos         26           /**< \brief (TAL_SMASK) Inter-Process Signal 26 */
#define TAL_SMASK_IPS26             (_U_(1) << TAL_SMASK_IPS26_Pos)
#define TAL_SMASK_IPS27_Pos         27           /**< \brief (TAL_SMASK) Inter-Process Signal 27 */
#define TAL_SMASK_IPS27             (_U_(1) << TAL_SMASK_IPS27_Pos)
#define TAL_SMASK_IPS28_Pos         28           /**< \brief (TAL_SMASK) Inter-Process Signal 28 */
#define TAL_SMASK_IPS28             (_U_(1) << TAL_SMASK_IPS28_Pos)
#define TAL_SMASK_IPS29_Pos         29           /**< \brief (TAL_SMASK) Inter-Process Signal 29 */
#define TAL_SMASK_IPS29             (_U_(1) << TAL_SMASK_IPS29_Pos)
#define TAL_SMASK_IPS30_Pos         30           /**< \brief (TAL_SMASK) Inter-Process Signal 30 */
#define TAL_SMASK_IPS30             (_U_(1) << TAL_SMASK_IPS30_Pos)
#define TAL_SMASK_IPS31_Pos         31           /**< \brief (TAL_SMASK) Inter-Process Signal 31 */
#define TAL_SMASK_IPS31             (_U_(1) << TAL_SMASK_IPS31_Pos)
#define TAL_SMASK_IPS_Pos           0            /**< \brief (TAL_SMASK) Inter-Process Signal x */
#define TAL_SMASK_IPS_Msk           (_U_(0xFFFFFFFF) << TAL_SMASK_IPS_Pos)
#define TAL_SMASK_IPS(value)        (TAL_SMASK_IPS_Msk & ((value) << TAL_SMASK_IPS_Pos))
#define TAL_SMASK_MASK              _U_(0xFFFFFFFF) /**< \brief (TAL_SMASK) MASK Register */

