BitBoxSwiss/bitbox02-firmware/external/samd51a-ds/include/component/tal.h
/* -------- TAL_SFLAGCLR : (TAL Offset: 0x220) ( /W 32) Inter-Process Signal Flag Clear -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
    struct {
        uint32_t IPS0: 1;          /*!< bit:      0  Inter-Process Signal 0             */
        uint32_t IPS1: 1;          /*!< bit:      1  Inter-Process Signal 1             */
        uint32_t IPS2: 1;          /*!< bit:      2  Inter-Process Signal 2             */
        uint32_t IPS3: 1;          /*!< bit:      3  Inter-Process Signal 3             */
        uint32_t IPS4: 1;          /*!< bit:      4  Inter-Process Signal 4             */
        uint32_t IPS5: 1;          /*!< bit:      5  Inter-Process Signal 5             */
        uint32_t IPS6: 1;          /*!< bit:      6  Inter-Process Signal 6             */
        uint32_t IPS7: 1;          /*!< bit:      7  Inter-Process Signal 7             */
        uint32_t IPS8: 1;          /*!< bit:      8  Inter-Process Signal 8             */
        uint32_t IPS9: 1;          /*!< bit:      9  Inter-Process Signal 9             */
        uint32_t IPS10: 1;         /*!< bit:     10  Inter-Process Signal 10            */
        uint32_t IPS11: 1;         /*!< bit:     11  Inter-Process Signal 11            */
        uint32_t IPS12: 1;         /*!< bit:     12  Inter-Process Signal 12            */
        uint32_t IPS13: 1;         /*!< bit:     13  Inter-Process Signal 13            */
        uint32_t IPS14: 1;         /*!< bit:     14  Inter-Process Signal 14            */
        uint32_t IPS15: 1;         /*!< bit:     15  Inter-Process Signal 15            */
        uint32_t IPS16: 1;         /*!< bit:     16  Inter-Process Signal 16            */
        uint32_t IPS17: 1;         /*!< bit:     17  Inter-Process Signal 17            */
        uint32_t IPS18: 1;         /*!< bit:     18  Inter-Process Signal 18            */
        uint32_t IPS19: 1;         /*!< bit:     19  Inter-Process Signal 19            */
        uint32_t IPS20: 1;         /*!< bit:     20  Inter-Process Signal 20            */
        uint32_t IPS21: 1;         /*!< bit:     21  Inter-Process Signal 21            */
        uint32_t IPS22: 1;         /*!< bit:     22  Inter-Process Signal 22            */
        uint32_t IPS23: 1;         /*!< bit:     23  Inter-Process Signal 23            */
        uint32_t IPS24: 1;         /*!< bit:     24  Inter-Process Signal 24            */
        uint32_t IPS25: 1;         /*!< bit:     25  Inter-Process Signal 25            */
        uint32_t IPS26: 1;         /*!< bit:     26  Inter-Process Signal 26            */
        uint32_t IPS27: 1;         /*!< bit:     27  Inter-Process Signal 27            */
        uint32_t IPS28: 1;         /*!< bit:     28  Inter-Process Signal 28            */
        uint32_t IPS29: 1;         /*!< bit:     29  Inter-Process Signal 29            */
        uint32_t IPS30: 1;         /*!< bit:     30  Inter-Process Signal 30            */
        uint32_t IPS31: 1;         /*!< bit:     31  Inter-Process Signal 31            */
    } bit;                       /*!< Structure used for bit  access                  */
    struct {
        uint32_t IPS: 32;          /*!< bit:  0..31  Inter-Process Signal x             */
    } vec;                       /*!< Structure used for vec  access                  */
    uint32_t reg;                /*!< Type      used for register access              */
} TAL_SFLAGCLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TAL_SFLAGCLR_OFFSET         0x220        /**< \brief (TAL_SFLAGCLR offset) Inter-Process Signal Flag Clear */
#define TAL_SFLAGCLR_RESETVALUE     _U_(0x00000000) /**< \brief (TAL_SFLAGCLR reset_value) Inter-Process Signal Flag Clear */

#define TAL_SFLAGCLR_IPS0_Pos       0            /**< \brief (TAL_SFLAGCLR) Inter-Process Signal 0 */
#define TAL_SFLAGCLR_IPS0           (_U_(1) << TAL_SFLAGCLR_IPS0_Pos)
#define TAL_SFLAGCLR_IPS1_Pos       1            /**< \brief (TAL_SFLAGCLR) Inter-Process Signal 1 */
#define TAL_SFLAGCLR_IPS1           (_U_(1) << TAL_SFLAGCLR_IPS1_Pos)
#define TAL_SFLAGCLR_IPS2_Pos       2            /**< \brief (TAL_SFLAGCLR) Inter-Process Signal 2 */
#define TAL_SFLAGCLR_IPS2           (_U_(1) << TAL_SFLAGCLR_IPS2_Pos)
#define TAL_SFLAGCLR_IPS3_Pos       3            /**< \brief (TAL_SFLAGCLR) Inter-Process Signal 3 */
#define TAL_SFLAGCLR_IPS3           (_U_(1) << TAL_SFLAGCLR_IPS3_Pos)
#define TAL_SFLAGCLR_IPS4_Pos       4            /**< \brief (TAL_SFLAGCLR) Inter-Process Signal 4 */
#define TAL_SFLAGCLR_IPS4           (_U_(1) << TAL_SFLAGCLR_IPS4_Pos)
#define TAL_SFLAGCLR_IPS5_Pos       5            /**< \brief (TAL_SFLAGCLR) Inter-Process Signal 5 */
#define TAL_SFLAGCLR_IPS5           (_U_(1) << TAL_SFLAGCLR_IPS5_Pos)
#define TAL_SFLAGCLR_IPS6_Pos       6            /**< \brief (TAL_SFLAGCLR) Inter-Process Signal 6 */
#define TAL_SFLAGCLR_IPS6           (_U_(1) << TAL_SFLAGCLR_IPS6_Pos)
#define TAL_SFLAGCLR_IPS7_Pos       7            /**< \brief (TAL_SFLAGCLR) Inter-Process Signal 7 */
#define TAL_SFLAGCLR_IPS7           (_U_(1) << TAL_SFLAGCLR_IPS7_Pos)
#define TAL_SFLAGCLR_IPS8_Pos       8            /**< \brief (TAL_SFLAGCLR) Inter-Process Signal 8 */
#define TAL_SFLAGCLR_IPS8           (_U_(1) << TAL_SFLAGCLR_IPS8_Pos)
#define TAL_SFLAGCLR_IPS9_Pos       9            /**< \brief (TAL_SFLAGCLR) Inter-Process Signal 9 */
#define TAL_SFLAGCLR_IPS9           (_U_(1) << TAL_SFLAGCLR_IPS9_Pos)
#define TAL_SFLAGCLR_IPS10_Pos      10           /**< \brief (TAL_SFLAGCLR) Inter-Process Signal 10 */
#define TAL_SFLAGCLR_IPS10          (_U_(1) << TAL_SFLAGCLR_IPS10_Pos)
#define TAL_SFLAGCLR_IPS11_Pos      11           /**< \brief (TAL_SFLAGCLR) Inter-Process Signal 11 */
#define TAL_SFLAGCLR_IPS11          (_U_(1) << TAL_SFLAGCLR_IPS11_Pos)
#define TAL_SFLAGCLR_IPS12_Pos      12           /**< \brief (TAL_SFLAGCLR) Inter-Process Signal 12 */
#define TAL_SFLAGCLR_IPS12          (_U_(1) << TAL_SFLAGCLR_IPS12_Pos)
#define TAL_SFLAGCLR_IPS13_Pos      13           /**< \brief (TAL_SFLAGCLR) Inter-Process Signal 13 */
#define TAL_SFLAGCLR_IPS13          (_U_(1) << TAL_SFLAGCLR_IPS13_Pos)
#define TAL_SFLAGCLR_IPS14_Pos      14           /**< \brief (TAL_SFLAGCLR) Inter-Process Signal 14 */
#define TAL_SFLAGCLR_IPS14          (_U_(1) << TAL_SFLAGCLR_IPS14_Pos)
#define TAL_SFLAGCLR_IPS15_Pos      15           /**< \brief (TAL_SFLAGCLR) Inter-Process Signal 15 */
#define TAL_SFLAGCLR_IPS15          (_U_(1) << TAL_SFLAGCLR_IPS15_Pos)
#define TAL_SFLAGCLR_IPS16_Pos      16           /**< \brief (TAL_SFLAGCLR) Inter-Process Signal 16 */
#define TAL_SFLAGCLR_IPS16          (_U_(1) << TAL_SFLAGCLR_IPS16_Pos)
#define TAL_SFLAGCLR_IPS17_Pos      17           /**< \brief (TAL_SFLAGCLR) Inter-Process Signal 17 */
#define TAL_SFLAGCLR_IPS17          (_U_(1) << TAL_SFLAGCLR_IPS17_Pos)
#define TAL_SFLAGCLR_IPS18_Pos      18           /**< \brief (TAL_SFLAGCLR) Inter-Process Signal 18 */
#define TAL_SFLAGCLR_IPS18          (_U_(1) << TAL_SFLAGCLR_IPS18_Pos)
#define TAL_SFLAGCLR_IPS19_Pos      19           /**< \brief (TAL_SFLAGCLR) Inter-Process Signal 19 */
#define TAL_SFLAGCLR_IPS19          (_U_(1) << TAL_SFLAGCLR_IPS19_Pos)
#define TAL_SFLAGCLR_IPS20_Pos      20           /**< \brief (TAL_SFLAGCLR) Inter-Process Signal 20 */
#define TAL_SFLAGCLR_IPS20          (_U_(1) << TAL_SFLAGCLR_IPS20_Pos)
#define TAL_SFLAGCLR_IPS21_Pos      21           /**< \brief (TAL_SFLAGCLR) Inter-Process Signal 21 */
#define TAL_SFLAGCLR_IPS21          (_U_(1) << TAL_SFLAGCLR_IPS21_Pos)
#define TAL_SFLAGCLR_IPS22_Pos      22           /**< \brief (TAL_SFLAGCLR) Inter-Process Signal 22 */
#define TAL_SFLAGCLR_IPS22          (_U_(1) << TAL_SFLAGCLR_IPS22_Pos)
#define TAL_SFLAGCLR_IPS23_Pos      23           /**< \brief (TAL_SFLAGCLR) Inter-Process Signal 23 */
#define TAL_SFLAGCLR_IPS23          (_U_(1) << TAL_SFLAGCLR_IPS23_Pos)
#define TAL_SFLAGCLR_IPS24_Pos      24           /**< \brief (TAL_SFLAGCLR) Inter-Process Signal 24 */
#define TAL_SFLAGCLR_IPS24          (_U_(1) << TAL_SFLAGCLR_IPS24_Pos)
#define TAL_SFLAGCLR_IPS25_Pos      25           /**< \brief (TAL_SFLAGCLR) Inter-Process Signal 25 */
#define TAL_SFLAGCLR_IPS25          (_U_(1) << TAL_SFLAGCLR_IPS25_Pos)
#define TAL_SFLAGCLR_IPS26_Pos      26           /**< \brief (TAL_SFLAGCLR) Inter-Process Signal 26 */
#define TAL_SFLAGCLR_IPS26          (_U_(1) << TAL_SFLAGCLR_IPS26_Pos)
#define TAL_SFLAGCLR_IPS27_Pos      27           /**< \brief (TAL_SFLAGCLR) Inter-Process Signal 27 */
#define TAL_SFLAGCLR_IPS27          (_U_(1) << TAL_SFLAGCLR_IPS27_Pos)
#define TAL_SFLAGCLR_IPS28_Pos      28           /**< \brief (TAL_SFLAGCLR) Inter-Process Signal 28 */
#define TAL_SFLAGCLR_IPS28          (_U_(1) << TAL_SFLAGCLR_IPS28_Pos)
#define TAL_SFLAGCLR_IPS29_Pos      29           /**< \brief (TAL_SFLAGCLR) Inter-Process Signal 29 */
#define TAL_SFLAGCLR_IPS29          (_U_(1) << TAL_SFLAGCLR_IPS29_Pos)
#define TAL_SFLAGCLR_IPS30_Pos      30           /**< \brief (TAL_SFLAGCLR) Inter-Process Signal 30 */
#define TAL_SFLAGCLR_IPS30          (_U_(1) << TAL_SFLAGCLR_IPS30_Pos)
#define TAL_SFLAGCLR_IPS31_Pos      31           /**< \brief (TAL_SFLAGCLR) Inter-Process Signal 31 */
#define TAL_SFLAGCLR_IPS31          (_U_(1) << TAL_SFLAGCLR_IPS31_Pos)
#define TAL_SFLAGCLR_IPS_Pos        0            /**< \brief (TAL_SFLAGCLR) Inter-Process Signal x */
#define TAL_SFLAGCLR_IPS_Msk        (_U_(0xFFFFFFFF) << TAL_SFLAGCLR_IPS_Pos)
#define TAL_SFLAGCLR_IPS(value)     (TAL_SFLAGCLR_IPS_Msk & ((value) << TAL_SFLAGCLR_IPS_Pos))
#define TAL_SFLAGCLR_MASK           _U_(0xFFFFFFFF) /**< \brief (TAL_SFLAGCLR) MASK Register */

/* -------- TAL_SFLAGSET : (TAL Offset: 0x228) ( /W 32) Inter-Process Signal Flag Set -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
    struct {
        uint32_t IPS0: 1;          /*!< bit:      0  Inter-Process Signal 0             */
        uint32_t IPS1: 1;          /*!< bit:      1  Inter-Process Signal 1             */
        uint32_t IPS2: 1;          /*!< bit:      2  Inter-Process Signal 2             */
        uint32_t IPS3: 1;          /*!< bit:      3  Inter-Process Signal 3             */
        uint32_t IPS4: 1;          /*!< bit:      4  Inter-Process Signal 4             */
        uint32_t IPS5: 1;          /*!< bit:      5  Inter-Process Signal 5             */
        uint32_t IPS6: 1;          /*!< bit:      6  Inter-Process Signal 6             */
        uint32_t IPS7: 1;          /*!< bit:      7  Inter-Process Signal 7             */
        uint32_t IPS8: 1;          /*!< bit:      8  Inter-Process Signal 8             */
        uint32_t IPS9: 1;          /*!< bit:      9  Inter-Process Signal 9             */
        uint32_t IPS10: 1;         /*!< bit:     10  Inter-Process Signal 10            */
        uint32_t IPS11: 1;         /*!< bit:     11  Inter-Process Signal 11            */
        uint32_t IPS12: 1;         /*!< bit:     12  Inter-Process Signal 12            */
        uint32_t IPS13: 1;         /*!< bit:     13  Inter-Process Signal 13            */
        uint32_t IPS14: 1;         /*!< bit:     14  Inter-Process Signal 14            */
        uint32_t IPS15: 1;         /*!< bit:     15  Inter-Process Signal 15            */
        uint32_t IPS16: 1;         /*!< bit:     16  Inter-Process Signal 16            */
        uint32_t IPS17: 1;         /*!< bit:     17  Inter-Process Signal 17            */
        uint32_t IPS18: 1;         /*!< bit:     18  Inter-Process Signal 18            */
        uint32_t IPS19: 1;         /*!< bit:     19  Inter-Process Signal 19            */
        uint32_t IPS20: 1;         /*!< bit:     20  Inter-Process Signal 20            */
        uint32_t IPS21: 1;         /*!< bit:     21  Inter-Process Signal 21            */
        uint32_t IPS22: 1;         /*!< bit:     22  Inter-Process Signal 22            */
        uint32_t IPS23: 1;         /*!< bit:     23  Inter-Process Signal 23            */
        uint32_t IPS24: 1;         /*!< bit:     24  Inter-Process Signal 24            */
        uint32_t IPS25: 1;         /*!< bit:     25  Inter-Process Signal 25            */
        uint32_t IPS26: 1;         /*!< bit:     26  Inter-Process Signal 26            */
        uint32_t IPS27: 1;         /*!< bit:     27  Inter-Process Signal 27            */
        uint32_t IPS28: 1;         /*!< bit:     28  Inter-Process Signal 28            */
        uint32_t IPS29: 1;         /*!< bit:     29  Inter-Process Signal 29            */
        uint32_t IPS30: 1;         /*!< bit:     30  Inter-Process Signal 30            */
        uint32_t IPS31: 1;         /*!< bit:     31  Inter-Process Signal 31            */
    } bit;                       /*!< Structure used for bit  access                  */
    struct {
        uint32_t IPS: 32;          /*!< bit:  0..31  Inter-Process Signal x             */
    } vec;                       /*!< Structure used for vec  access                  */
    uint32_t reg;                /*!< Type      used for register access              */
} TAL_SFLAGSET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

