BitBoxSwiss/bitbox02-firmware/external/samd51a-ds/include/component/tal.h
/* -------- TAL_SFLAGCLRR : (TAL Offset: 0x300) (R/W  8) Inter-Process Signal Flag Bit n -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
    struct {
        uint8_t  IPS: 1;           /*!< bit:      0  Inter-Process Signal n             */
        uint8_t  : 7;              /*!< bit:  1.. 7  Reserved                           */
    } bit;                       /*!< Structure used for bit  access                  */
    uint8_t reg;                 /*!< Type      used for register access              */
} TAL_SFLAGCLRR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TAL_SFLAGCLRR_OFFSET        0x300        /**< \brief (TAL_SFLAGCLRR offset) Inter-Process Signal Flag Bit n */
#define TAL_SFLAGCLRR_RESETVALUE    _U_(0x00)    /**< \brief (TAL_SFLAGCLRR reset_value) Inter-Process Signal Flag Bit n */

#define TAL_SFLAGCLRR_IPS_Pos       0            /**< \brief (TAL_SFLAGCLRR) Inter-Process Signal n */
#define TAL_SFLAGCLRR_IPS           (_U_(0x1) << TAL_SFLAGCLRR_IPS_Pos)
#define TAL_SFLAGCLRR_MASK          _U_(0x01)    /**< \brief (TAL_SFLAGCLRR) MASK Register */

/** \brief TalCpuirqs hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
    __I  TAL_CPUIRQS_Type
    CPUIRQS[5];  /**< \brief Offset: 0x000 (R/  32) Interrupt Status m for CPU n */
    RoReg8                    Reserved1[0xC];
} TalCpuirqs;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** \brief TalCtis hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
    __IO TAL_CTICTRLA_Type
    CTICTRLA;    /**< \brief Offset: 0x000 (R/W  8) Cross-Trigger Interface n Control A */
    __IO TAL_CTIMASK_Type
    CTIMASK;     /**< \brief Offset: 0x001 (R/W  8) Cross-Trigger Interface n Mask */
} TalCtis;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** \brief TalSmasks hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
    __IO TAL_SMASK_Type
    SMASK[2];    /**< \brief Offset: 0x000 (R/W 32) Inter-Process Signal Mask m for CPU n */
} TalSmasks;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** \brief TAL hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
    __IO TAL_CTRLA_Type
    CTRLA;       /**< \brief Offset: 0x000 (R/W  8) Control A */
    __IO TAL_EXTCTRL_Type
    EXTCTRL;     /**< \brief Offset: 0x001 (R/W  8) External Break Control */
    RoReg8                    Reserved1[0x2];
    __IO TAL_EVCTRL_Type
    EVCTRL;      /**< \brief Offset: 0x004 (R/W 16) Event Control */
    RoReg8                    Reserved2[0x2];
    __IO TAL_INTENCLR_Type
    INTENCLR;    /**< \brief Offset: 0x008 (R/W  8) Interrupt Enable Clear */
    __IO TAL_INTENSET_Type
    INTENSET;    /**< \brief Offset: 0x009 (R/W  8) Interrupt Enable Set */
    __IO TAL_INTFLAG_Type
    INTFLAG;     /**< \brief Offset: 0x00A (R/W  8) Interrupt Flag Status and Clear */
    __IO TAL_GLOBMASK_Type
    GLOBMASK;    /**< \brief Offset: 0x00B (R/W  8) Global Break Requests Mask */
    __O  TAL_HALT_Type
    HALT;        /**< \brief Offset: 0x00C ( /W  8) Debug Halt Request */
    __O  TAL_RESTART_Type
    RESTART;     /**< \brief Offset: 0x00D ( /W  8) Debug Restart Request */
    __I  TAL_BRKSTATUS_Type
    BRKSTATUS;   /**< \brief Offset: 0x00E (R/  16) Break Request Status */
    TalCtis
    Ctis[4];     /**< \brief Offset: 0x010 TalCtis groups [CTI_NUM] */
    RoReg8                    Reserved3[0x8];
    __I  TAL_INTSTATUS_Type
    INTSTATUS[137]; /**< \brief Offset: 0x020 (R/   8) Interrupt n Status */
    RoReg8                    Reserved4[0x67];
    __IO TAL_DMACPUSEL0_Type
    DMACPUSEL0;  /**< \brief Offset: 0x110 (R/W 32) DMA Channel Interrupts CPU Select 0 */
    __IO TAL_DMACPUSEL1_Type
    DMACPUSEL1;  /**< \brief Offset: 0x114 (R/W 32) DMA Channel Interrupts CPU Select 1 */
    __IO TAL_EVCPUSEL0_Type
    EVCPUSEL0;   /**< \brief Offset: 0x118 (R/W 32) EVSYS Channel Interrupts CPU Select 0 */
    RoReg8                    Reserved5[0x4];
    __IO TAL_EICCPUSEL0_Type
    EICCPUSEL0;  /**< \brief Offset: 0x120 (R/W 32) EIC External Interrupts CPU Select 0 */
    RoReg8                    Reserved6[0x4];
    __IO TAL_INTCPUSEL0_Type
    INTCPUSEL0;  /**< \brief Offset: 0x128 (R/W 32) Interrupts CPU Select 0 */
    __IO TAL_INTCPUSEL1_Type
    INTCPUSEL1;  /**< \brief Offset: 0x12C (R/W 32) Interrupts CPU Select 1 */
    __IO TAL_INTCPUSEL2_Type
    INTCPUSEL2;  /**< \brief Offset: 0x130 (R/W 32) Interrupts CPU Select 2 */
    __IO TAL_INTCPUSEL3_Type
    INTCPUSEL3;  /**< \brief Offset: 0x134 (R/W 32) Interrupts CPU Select 3 */
    __IO TAL_INTCPUSEL4_Type
    INTCPUSEL4;  /**< \brief Offset: 0x138 (R/W 32) Interrupts CPU Select 4 */
    __IO TAL_INTCPUSEL5_Type
    INTCPUSEL5;  /**< \brief Offset: 0x13C (R/W 32) Interrupts CPU Select 5 */
    __IO TAL_INTCPUSEL6_Type
    INTCPUSEL6;  /**< \brief Offset: 0x140 (R/W 32) Interrupts CPU Select 6 */
    __IO TAL_INTCPUSEL7_Type
    INTCPUSEL7;  /**< \brief Offset: 0x144 (R/W 32) Interrupts CPU Select 7 */
    __IO TAL_INTCPUSEL8_Type
    INTCPUSEL8;  /**< \brief Offset: 0x148 (R/W 32) Interrupts CPU Select 8 */
    RoReg8                    Reserved7[0x18];
    __IO TAL_IRQTRIG_Type
    IRQTRIG;     /**< \brief Offset: 0x164 (R/W 32) Interrupt Trigger */
    __IO TAL_IRQMON_Type
    IRQMON[1];   /**< \brief Offset: 0x168 (R/W 16) Interrupt Monitor Select */
    RoReg8                    Reserved8[0x16];
    TalCpuirqs
    Cpuirqs[2];  /**< \brief Offset: 0x180 TalCpuirqs groups [CPU_NUM] */
    RoReg8                    Reserved9[0x40];
    TalSmasks
    Smasks[2];   /**< \brief Offset: 0x200 TalSmasks groups [CPU_NUM] */
    RoReg8                    Reserved10[0x10];
    __O  TAL_SFLAGCLR_Type
    SFLAGCLR[2]; /**< \brief Offset: 0x220 ( /W 32) Inter-Process Signal Flag Clear */
    __O  TAL_SFLAGSET_Type
    SFLAGSET[2]; /**< \brief Offset: 0x228 ( /W 32) Inter-Process Signal Flag Set */
    __I  TAL_SFLAG_Type
    SFLAG[2];    /**< \brief Offset: 0x230 (R/  32) Inter-Process Signal Flag */
    RoReg8                    Reserved11[0xC8];
    __IO TAL_SFLAGCLRR_Type
    SFLAGCLRR[64]; /**< \brief Offset: 0x300 (R/W  8) Inter-Process Signal Flag Bit n */
} Tal;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAMD51_TAL_COMPONENT_ */
